; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj10 - airport
	obj1 obj11 - city
	obj2 obj12 - truck
	obj3 obj6 obj7 obj9 obj13 - airplane
	obj4 obj5 obj8 obj14 obj15 - package
	obj16 - location
)

(:init
	(at obj7 obj0)
	(at obj2 obj0)
	(at obj3 obj0)
	(at obj15 obj0)
	(in-city obj16 obj1)
	(at obj12 obj10)
	(at obj9 obj0)
	(in-city obj10 obj11)
	(in-city obj0 obj1)
	(at obj13 obj0)
	(at obj4 obj0)
	(at obj5 obj0)
	(at obj6 obj0)
	(at obj14 obj10)
	(at obj8 obj0)
)

(:goal (and
	(at obj4 obj10)
	(at obj14 obj0)
	(at obj8 obj10)
	(at obj15 obj10)
	(at obj5 obj10)
))
)

; plan
1. (load obj9 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj9)
   goals met: 0 of 5
2. (load obj9 obj5 obj0)
   deleted: (at obj5 obj0)
   added: (in obj5 obj9)
   goals met: 0 of 5
3. (load obj9 obj4 obj0)
   deleted: (at obj4 obj0)
   added: (in obj4 obj9)
   goals met: 0 of 5
4. (load obj9 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj9)
   goals met: 0 of 5
5. (fly obj9 obj0 obj10)
   deleted: (at obj9 obj0)
   added: (at obj9 obj10)
   goals met: 0 of 5
6. (unload obj9 obj8 obj10)
   deleted: (in obj8 obj9)
   added: (at obj8 obj10)
   goals met: 1 of 5
7. (unload obj9 obj5 obj10)
   deleted: (in obj5 obj9)
   added: (at obj5 obj10)
   goals met: 2 of 5
8. (unload obj9 obj4 obj10)
   deleted: (in obj4 obj9)
   added: (at obj4 obj10)
   goals met: 3 of 5
9. (unload obj9 obj15 obj10)
   deleted: (in obj15 obj9)
   added: (at obj15 obj10)
   goals met: 4 of 5
10. (load obj9 obj14 obj10)
   deleted: (at obj14 obj10)
   added: (in obj14 obj9)
   goals met: 4 of 5
11. (fly obj9 obj10 obj0)
   deleted: (at obj9 obj10)
   added: (at obj9 obj0)
   goals met: 4 of 5
12. (unload obj9 obj14 obj0)
   deleted: (in obj14 obj9)
   added: (at obj14 obj0)
   goals met: 5 of 5
